In [123]:
# Output one list of [name1, num, name2], and one names list to store all names. 
with open('2015-Q13_tyler.txt') as f:
    data_lst = []
    names_lst = []
    for line in f.readlines():
        line_lst = line.split()
        if line_lst[2] == 'gain':
            data_lst.append([line_lst[0], int(line_lst[3]), line_lst[-1][:-1]])
        else:
            data_lst.append([line_lst[0], -int(line_lst[3]), line_lst[-1][:-1]])
        names_lst.append(line_lst[0])
    names_set = set(names_lst)
f.close()

In [124]:
names_set

{'Alice', 'Bob', 'Carol', 'David', 'Eric', 'Frank', 'George', 'Mallory'}

In [10]:
import itertools

# List all permutation of names
#p = [list(i) for i in list(itertools.permutations(names_lst))]
p = list(itertools.permutations(names_lst))

In [32]:
# Use tuple
def start_cycle_tuple(t):
    lst = list(t)
    l1 = lst[1:]
    l1.append(lst[0])
    t1 = tuple(l1)
    return t1

In [87]:
def clean_sequence(permutations_list):
    # Due to cycle table, every squence will be repeated by 2*len(s) times. ex: "abc" is same as "bca", "cab" and 3 reverse sequence. 
    all_scenarios_list = []
    sequence_tuple_set = {''}
    for line_tuple in permutations_list:
        if line_tuple not in sequence_tuple_set:
            all_scenarios_list.append(line_tuple)
        temp_lst = list(line_tuple)
        temp_lst.reverse()
        temp_tuple = tuple(temp_lst)
        temp_tuple_r = line_tuple
        for i in range(len(line_tuple)):
            sequence_tuple_set.add(temp_tuple_r)
            sequence_tuple_set.add(temp_tuple)
            temp_tuple_r = start_cycle_tuple(temp_tuple_r)
            temp_tuple = start_cycle_tuple(temp_tuple)
            
    return all_scenarios_list

In [88]:
# All scenarios for cycle table. 
all_scenarios = clean_sequence(p)

In [90]:
all_scenarios[0]

('Eric', 'Mallory', 'George', 'Frank', 'Alice', 'David', 'Carol', 'Bob')

In [103]:
import pandas as pd

df = pd.DataFrame(index = names_lst, columns = names_lst)
for line in data_lst:
    df[line[0]][line[2]] = line[1]

In [127]:
df

        Eric Mallory George Frank Alice David Carol  Bob
Eric     NaN     -66     54   -17    21   -30   -46   49
Mallory  -99     NaN      7   -56   -80   -20    10   29
George    34     -99    NaN    18    -4    75   -35   23
Frank     95     -75     30   NaN   -81   -12    33   68
Alice      8      31     45   -97   NaN    43   -54   93
David    -34      91     54    56    65   NaN   -37    5
Carol    -69      95     63    -9   -62   -53   NaN   19
Bob      -89     -32     76     6    -2   -96   -70  NaN

In [105]:
all_scenarios[0]

('Eric', 'Mallory', 'George', 'Frank', 'Alice', 'David', 'Carol', 'Bob')

In [116]:
def cal_happiness(onetuple, one_df):
    result = 0
    num = len(onetuple)
    for i in range(-1, num-1):
        result += one_df[onetuple[i]][onetuple[i+1]] + one_df[onetuple[i+1]][onetuple[i]]
    return result

In [114]:
all_results = []
for t in all_scenarios:
    r = cal_happiness(t, df)
    all_results.append(r)

In [115]:
max_happiness = max(all_results)
print(max_happiness)

664

In [ ]:
all_results